app/views/shared/_sidenav.html.erb

SELECT "semesters".* FROM "semesters"
---
        <% if teacher_logged_in? %>
            <% Semester.all.each do | semester |%>

SELECT "courses".* FROM "courses" WHERE "courses"."open" = $1  [["open", "t"]]
---
                  <span class="glyphicon glyphicon-chevron-right"></span> 预约主机
                  <span class="label label-info pull-right"><%= (Course.where(:open => true)-current_user.courses).length %></span>

SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 3]]
---
                  <span class="glyphicon glyphicon-chevron-right"></span> 已约主机
                  <span class="label label-info pull-right"><%= current_user.courses.length %></span>

SELECT "grades".* FROM "grades" WHERE "grades"."course_id" = $1 AND "grades"."open" = $2  [["course_id", 1], ["open", "f"]]
---
                      <span class="glyphicon glyphicon-chevron-right"></span> <%= course.name %>
                      <span class="label label-info pull-right"><%= course.grades.where(:open=>false).length %></span>