app/views/courses/list.html.erb

                                <td><%= course.limit_num %></td>
                                <td><%= course.grades.where(:open=>false).length %></td>
---
SELECT "grades".* FROM "grades" WHERE "grades"."course_id" = $1 AND "grades"."open" = $2  [["course_id", 1], ["open", "f"]]

                                <td><%= link_to course.teacher.name,show_more_1_course_path(course) %></td>
                                <% if course.limit_num>course.grades.where(:open=>false).length&&current_user.courses.length<2 %>
---
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 7]]