app/controllers/comments_controller.rb

  def edit
    @comment=Comment.find_by_id(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @comment = Comment.find_by_id(params[:id])
    if @comment.update_attributes(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "comments" SET "item_one" = $1, "item_two" = $2, "item_three" = $3, "item_four" = $4, "item_five" = $5, "item_six" = $6, "updated_at" = $7 WHERE "comments"."id" = $8  [["item_one", 100], ["item_two", 100], ["item_three", 100], ["item_four", 100], ["item_five", 100], ["item_six", 100], ["updated_at", "2019-07-03 04:24:41.872304"], ["id", 1]]

  def list
    @course=Course.find_by_id(params[:course_id])
    @comments=@course.comments
    @comments_score = Array[0,0,0,0,0,0]
    @comments_count = Array[0,0,0,0,0,0]
    @comments.each do |comment|
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."course_id" = $1  [["course_id", 3]]