app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)
    if @course.save
---
INSERT INTO "courses" ("course_code", "name", "course_type", "teaching_type", "exam_type", "credit", "limit_num", "class_room", "course_time", "course_week", "semester_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def edit
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @course = Course.find_by_id(params[:id])
    if @course.update_attributes(course_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "limit_num" = $1, "semester_id" = $2, "updated_at" = $3 WHERE "courses"."id" = $4  [["limit_num", 1], ["semester_id", 1], ["updated_at", "2019-07-03 03:13:31.114759"], ["id", 1]]

  def destroy
    @course=Course.find_by_id(params[:id])
    current_user.teaching_courses.delete(@course)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 1]]

  def open
    @course = Course.find_by_id(params[:id])
    if @course.update_attributes(:open=>true)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "t"], ["updated_at", "2019-07-03 03:43:19.142393"], ["id", 2]]

  def close
    @course = Course.find_by_id(params[:id])
    if @course.update_attributes(:open=>false)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "f"], ["updated_at", "2019-07-03 04:22:16.187844"], ["id", 3]]

  def selected
    @course = Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def chart
    @course = Course.find_by_id(params[:id])
    @student=@course.users
    @student_department = {}
    @student.each do |stu|
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "users".* FROM "users" INNER JOIN "grades" ON "users"."id" = "grades"."user_id" WHERE "grades"."course_id" = $1  [["course_id", 3]]

  def list
    @course=Course.all
    @q = Course.ransack(params[:q])
    @course = @q.result.includes(:teacher)
    @course = @q.result(distinct: true)
    @course=@course.where(:open=>true)
    @course=@course-current_user.courses
    @current_user_course=current_user.courses
    @course_time_table = get_current_curriculum_table(@current_user_course, current_user)
    @course_time = get_course_info(@course, 'course_time')
    @course_exam_type = get_course_info(@course, 'exam_type')
    @course_credit = get_course_info(@course, 'credit')
    @course_type = get_course_info(@course, 'course_type')
    @teaching_type = get_course_info(@course, 'teaching_type')
    if request.post?
      res = []
      @course.each do |course|
---
SELECT DISTINCT "courses".* FROM "courses" WHERE "courses"."open" = $1  [["open", "t"]]
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 3]]

  def select
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def quit
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def show_more_1
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 3]]

  def apply
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def advise
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 3]]