app/controllers/emails_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
---
  def create
    @course=Course.find_by_id(params[:id])
    @sender = params[:sender]
    @recipient = params[:recipient]
    @subject = params[:subject]
    @body = params[:body]
    @recipient_email=User.find_by_id(@course.teacher).email