app/controllers/grades_controller.rb

  def update
    @grade=Grade.find_by_id(params[:id])
    if @grade.update_attributes!(:grade => params[:grade][:grade])
---
SELECT  "grades".* FROM "grades" WHERE "grades"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "grades" SET "grade" = $1, "updated_at" = $2 WHERE "grades"."id" = $3  [["grade", 60], ["updated_at", "2019-07-03 02:52:58.426631"], ["id", 2]]

  def index
    if teacher_logged_in?
      @course=Course.find_by_id(params[:course_id])
      @grades=@course.grades.where(:open=>false)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."open" = $1  [["open", "t"]]
SELECT "grades".* FROM "grades" WHERE "grades"."course_id" = $1 AND "grades"."open" = $2  [["course_id", 1], ["open", "f"]]